---
kind: method
id: M:Autodesk.Revit.DB.ClassificationEntry.HasInvalidKey
source: html/4f632955-9e4f-80e8-6220-75fdfa15298d.htm
---
# Autodesk.Revit.DB.ClassificationEntry.HasInvalidKey Method

Checks if the key matches the level and parent key.

## Syntax (C#)
```csharp
public bool HasInvalidKey()
```

## Returns
True if the key doesn't matach the level and parent key.
 False otherwise.